# GeneratedByMassing Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..GeneratedByMassing Property
BuiltInFailures..::..EditingFailures Class See Also
---
Selected element(s) produced from Massing shape. Once deleted, the selected element(s) will not be regenerated
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId GeneratedByMassing { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GeneratedByMassing As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ GeneratedByMassing {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace